mjf/oauth_tests/oauth_consumer/app/controllers/oauth_consumers_controller.rb

  def index
    if current_user
      @consumer_tokens=ConsumerToken.all :conditions=>{:user_id=>current_user.id}
---
SELECT * FROM `consumer_tokens` WHERE (`consumer_tokens`.`user_id` = 1)