mjf/oauth_tests/oauth_consumer/app/controllers/users_controller.rb

SELECT * FROM `users`
---
  def index
    @users = User.all

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES('2010-01-19 03:12:58', '2010-01-19 03:12:58', 'mike')
---
  def create
    @user = User.new(params[:user])
    if @user.save