mjf/oauth_tests/oauth_provider/app/controllers/oauth_clients_controller.rb

  def index
    @client_applications = current_user.client_applications
    @tokens = current_user.tokens.find :all, :conditions => 'oauth_tokens.invalidated_at is null and oauth_tokens.authorized_at is not null'
---
SELECT * FROM `client_applications` WHERE (`client_applications`.user_id = 2)
SELECT * FROM `oauth_tokens` WHERE (`oauth_tokens`.user_id = 2 AND (oauth_tokens.invalidated_at is null and oauth_tokens.authorized_at is not null)) ORDER BY authorized_at desc

  def create
    @client_application = current_user.client_applications.build(params[:client_application])
    if @client_application.save
---
INSERT INTO `client_applications` (`name`, `created_at`, `support_url`, `callback_url`, `updated_at`, `url`, `user_id`, `key`, `secret`) VALUES('Consumer App', '2010-01-20 18:38:39', '', 'http://localhost:3001', '2010-01-20 18:38:39', 'http://localhost:3001', 2, 'a9ytSXB8lN2bAYrUzDJt', 'MmwzFr8ldUJFejBbNI8JPyUU3sGshVI1z4qIau2D')

  def update
    if @client_application.update_attributes(params[:client_application])
---
UPDATE `client_applications` SET `updated_at` = '2010-01-22 22:20:53', `name` = 'My PDS App1' WHERE `id` = 1

  def destroy
    @client_application.destroy
---
DELETE FROM `client_applications` WHERE `id` = 1