mjf/oauth_tests/oauth_provider/app/controllers/test_api_controller.rb

SELECT * FROM `blogs` WHERE (`blogs`.`user_id` = 2)
---
  def index
    puts "--------- Incoming PDS Request ---------"
    puts @user.username
    puts
    puts current_token
    puts "----------------------------------------"

    @blogs = Blog.find_all_by_user_id @user.id