mjf/oauth_tests/oauth_provider/app/controllers/token_syncs_controller.rb

  def index
    @token_syncs = TokenSync.all
---
SELECT * FROM `token_syncs`

  def show
    @token_sync = TokenSync.find(params[:id])
---
SELECT * FROM `token_syncs` WHERE (`token_syncs`.`id` = 1)

  def create
    @token_sync = TokenSync.new(params[:token_sync])
    if @token_sync.save
---
INSERT INTO `token_syncs` (`created_at`, `callback_url`, `updated_at`, `peer_name`) VALUES('2010-01-22 17:31:33', 'http://localhost:3002/peer_update', '2010-01-22 17:31:33', 'KPDS')

  def resync
    result = {}
    user = User.find_by_id params[:id]
---
SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1