mjf/oauth_tests/oauth_provider/app/controllers/users_controller.rb

INSERT INTO `users` (`street_st`, `created_at`, `crypted_password`, `updated_at`, `username`, `street_address`, `password_salt`, `last_name`, `street_zip`, `persistence_token`, `street_city`, `email`, `first_name`) VALUES('ID', '2010-01-20 18:37:21', '93e579671bbc412520eeb16e07991621d357deb83e377f0f681e5209dfb9d2f97e97c8c9149bc1a06fead91c6a8d0d83545c333426b29d55d7a45ee06b143922', '2010-01-20 18:37:21', 'mikefarmer', '3674 Capstone Dr', 'X0f_lj3x_yXZZf8z-MjQ', 'Farmer', '83401', '0abda2d1e991e14dd64d9eae52d9d5e2461434569ddc8dd2df9d77ac1c0dfbc21e7d63f6cf0a5497064f00908f7abc8d084bdb883af2356d52cc373723f92bf4', 'Idaho Falls', 'mike.farmer@gmail.com', 'Michael')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE `users` SET `updated_at` = '2010-01-22 20:39:14', `crypted_password` = '1979305ac45fd677d28b01734440747967cc3274ed2d759b30da9a22b6b7dc2fee8afb1847b8ddc62ceb8738f30a7eb4f9d752afb24300eb243ddf117f84ea29', `first_name` = 'Michael J ', `password_salt` = 'hG5HQ-zCpnRZEGHK-uLR', `persistence_token` = '68ced4d8dd5839294841d4d0408b8bd54e5214988c93968010caa2b8eb9c1032ff27ca7083467e237c3c4eb2b7a2450119ef45049a34aeb92590f5e4beb576c5' WHERE `id` = 2
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])